## Plan Result (915: sds_prod_ado - TerraformPlanApply)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.mi_externalsharing_contributor[0]
* Update
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.mi_externalsharing_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_externalsharing_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "66f94809-0bdf-4677-b861-a827beea0d0c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/miexternalsharingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.azure-devops-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "azure-devops-mi" {
        id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/managed-identities-prod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-devops-prod-mi"
        name                = "azure-devops-prod-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/ado-shared-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 915: sds_prod_ado - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/ado-shared-infra/issues/9/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"915: sds_prod_ado - TerraformPlanApply","Vars":{}} -->